workspace/Pensoft/Altova/MapForce2013/MapForceExamples/TimeService/getOffsetUTC

<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:SOAP-ENC="http://schemas.xmlsoap.org/soap/encoding/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema">
	<SOAP-ENV:Body>
		<m:getOffesetUTCTime xmlns:m="http://www.Nanonull.com/TimeService/">
			<m:hoursOffset>1</m:hoursOffset>
		</m:getOffesetUTCTime>
	</SOAP-ENV:Body>
</SOAP-ENV:Envelope>
